#### ExportPatternInfo Members

---

|  |
| --- |
| ExportPatternInfo Class   Constructors   Methods   Properties   See Also |

The  ExportPatternInfo  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ExportPatternInfo | Constructs a new default ExportPatternInfo. |
| Public method | ExportPatternInfo(String) | Constructs a new ExportPatternInfo using the destination pattern name as input. |
| Public method | ExportPatternInfo(ExportPatternInfo) | Constructs a new copy of the input ExportPatternInfo object. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ExportPatternInfo |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | DestinationPatternName | The destination pattern name (the name of the pattern in the exported format). |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

ExportPatternInfo Class

Autodesk.Revit.DB Namespace